package home_01;

public class ClassExecise {
	

}
/*클래스 - 메소드 - 인터페이스 - 정적클래스*/

/*note
 * 10일차 6번예제랑 포인트 
 * 1.복사생성자 왜 쓰는거지? 
 * 
 * 보드 프로그램 
 *  num<=count -> 왜???(+1 되어서)
 *    
 *    
 *  2. 11일차 생성자 오버로딩 예제
 *  -> 
 *  public A(double num10, double num11){
	  
	} 실수 ->정수는 불가능
	왜 주석처리 되어있지?? -> 위에 메인메소드에서 사용한 a 생성자 오버로딩(실수, 정수)을 설명하기 위해서
	
	3. 메소드테스트 -> 시스아웃 안의 프린트메소드는 왜안되는거지?(주석처리부분 int 정수로 맞춰도 안됨) //반만 이해함
	
	12일차
	4. InheritanceTest1 상속에서 접근제한자의 범위 왜 private만 안되지?
	
	5. this();의 의미
	
	6. get set왜 만드는거더라? 생성자랑 관련있나?
	
	13일차
	7. cartest에서 왜 에러가 안나지???
 * */
 