package study_home;

public class Lotto {

	public static void main(String[] args) {
		/*사용자번호를 랜덤으로 작성하고 당첨번호를 입력하면 당첨등수를 출력하는 코드를 작성
		 * 사용자번호(매개변수명 user[]): min=1,max=45,중복x,랜덤숫자 6개
		 * 당첨번호(변수명 com[]): min=1,max=45, 중복x, 랜덤숫자 6개+1개
		 * => 동일한 메소드 하나 작성하고 그거 끌어다 쓰면 될 듯
		 * 
		 * 사용할 변수값 
		 * user[], com[], cnt(중복숫자확인 후 저장), i,j(이중 포문에서 사용), 
		 * r(랜덤숫자임시배정), count(중복숫자 확인 갯수), n(숫자 생성 몇개나 할지)
		 * 
		 * 
		 * */

	}
	/* 중복 가려내는 코드 작성*/
	
	/* 1~45 랜덤숫자 n개 배열[]에 저장하는 코드 작성*/
	
	/* u와 c 각각의 숫자 비교 (전체 중복 갯수 - 번지갯수)(스트라이크와 볼 사례)*/
	
	/* 메인? : 번호 n개 일치하면 n-i등 출력하기? i=5부터 1개씩 감소? 이상한뎅
	 * 이렇게 하려면 2등나올때는 일단 패스시켜야함 ㅎㅎ;
	 * 
	 * count값으로 몇개까지 셀지 정해서 int com[7];중에
	 * com[5]번지까지만 중복 출력하고 안에 if문으로 중복값 2 이하면 꽝 출력후 브레이크; 
	 * 
	 * 이중 for문 끝나면 예외로 밑에 for문 다시 돌려서
	 *  
	 * com[6]이랑 중복되는 u값 검색하고 없으면 컨티뉴
	 * 있으면 중복값 cnt가 6인지 확인후 6이면 2등! 
	 * */
	
	/* 지울것
	 * 두 와일 너무 하기싫은데 ...해야겟지 흐흫흑 이거랑 향상된 포문은 아직도 적용을 못하겟네
	 * 
	 * */

}
